Учет_ФК/src/Documents/ПаспортЛота/ПаспортЛота.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПаспортЛота</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПримесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиСодержанияAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиСодержанияAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПримесиSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПримесиCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПрмесиAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТочностиПрмесиFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоСухой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Au</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ag</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sобщ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сорг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_As</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Fe</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/InformationRegisters/ДанныеЗатаркиТранспортировочныхМест/ДанныеЗатаркиТранспортировочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеЗатаркиТранспортировочныхМест</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоВлажный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерМеста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоСухой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/InformationRegisters/ДанныеСодержанияДМИПримесейВТранспортировочныхМестах/ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеСодержанияДМИПримесейВТранспортировочныхМестах</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоAu</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоAg</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоSобщ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоCорг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоAs</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоFe</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТранспортировочноеМесто</name>
    <type>
      <types>CatalogRef.ТранспортировочныеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учет_ФК/src/Documents/ТранспортировкаПродукции/ТранспортировкаПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТранспортировкаПродукции</name>
  <basedOn>Document.ПоступлениеПродукцииИзТранспортировки</basedOn>
  <registerRecords>AccumulationRegister.ПродукцияВПути</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПродукцииНаСкладе</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоперевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГрузоперевозчика</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВизаОтправителя</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>ТранспортировочноеМесто</name>
      <type>
        <types>CatalogRef.ТранспортировочныеМеста</types>
      </type>
    </attributes>
    <attributes>
      <name>ПартияПродукции</name>
      <type>
        <types>CatalogRef.ПартииПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоВлажный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПломбы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВПартии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоВлажныйИсходный</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеРедактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерМестаВКонтракте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_ФК/src/Documents/ПаспортЛота/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	
	параметрыФормы = Новый Структура;
	параметрыФормы.Вставить("РежимВыбора"		,Истина);
	параметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца"		,Истина);
	параметрыФормы.Вставить("ЗакрыватьПриВыборе"		,Ложь);
	ФормаВыбора = ПолучитьФорму("Справочник.ТранспортировочныеМеста.ФормаВыбора",параметрыФормы,ЭтаФорма,,,);
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ТранспортировочныеМеста.Форма.ФормаВыбора" Тогда 
		СтруктураДанных  = Новый Структура();
		СтруктураДанных.Вставить("ВыбранноеЗначение",ВыбранноеЗначение);
		ДобавитьСтрокуНаСервере(СтруктураДанных);
		ПроизвестиРасчетНаКлиенте();
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ТранспортировкаПродукции.Форма.ФормаВыбора" Тогда 
		
		СтруктураДанных  = Новый Структура();
		СтруктураДанных.Вставить("ВыбранноеЗначение",ВыбранноеЗначение);
		
		
		ДобавитьСтрокиИзТранспортиртировкиНаСервере(СтруктураДанных);
		ПроизвестиРасчетНаКлиенте();
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ПродукцияПодбор.Доступность = Не ЭтаФорма.ТолькоПросмотр;
КонецПроцедуры


&НаКлиенте
Процедура ПродукцияТранспортировочноеМестоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Продукция.ТекущиеДанные;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТранспортировочноеМесто"	,СтрокаТабличнойЧасти.ТранспортировочноеМесто);
	СтруктураДанных.Вставить("Партия"					,ПредопределенноеЗначение("Справочник.ПартииПродукции.ПустаяСсылка"));
	СтруктураДанных.Вставить("ВесБруттоВлажный"			,0);
	СтруктураДанных.Вставить("ВесНеттоВлажный"			,0);
	СтруктураДанных.Вставить("ВесНеттоСухой"			,0);
	СтруктураДанных.Вставить("НомерПломбы"				,"");
	СтруктураДанных.Вставить("Au"						,0);
	СтруктураДанных.Вставить("Ag"						,0);
	СтруктураДанных.Вставить("Sобщ"						,0);
	СтруктураДанных.Вставить("Сорг"						,0);
	СтруктураДанных.Вставить("_As"						,0);
	СтруктураДанных.Вставить("Fe"						,0);
	
	ЗаполнитьСтруктуруДанныхВыпуска(СтруктураДанных);
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтруктураДанных,,);
	ПроизвестиРасчетНаКлиенте();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруДанныхВыпуска(СтруктураДанных)
	Если СтруктураДанных.ТранспортировочноеМесто.Пустая() Тогда 
		Возврат
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеЗатаркиТранспортировочныхМест.Партия КАК Партия,
		|	ЕСТЬNULL(ДанныеЗатаркиТранспортировочныхМест.НомерМеста, 0) КАК НомерМеста,
		|	ЕСТЬNULL(ДанныеЗатаркиТранспортировочныхМест.ВесБруттоВлажный, 0) КАК ВесБруттоВлажный,
		|	ЕСТЬNULL(ДанныеЗатаркиТранспортировочныхМест.ВесНеттоВлажный, 0) КАК ВесНеттоВлажный,
		|	ЕСТЬNULL(ДанныеЗатаркиТранспортировочныхМест.ВесНеттоСухой, 0) КАК ВесНеттоСухой,
		|	ЕСТЬNULL(ДанныеЗатаркиТранспортировочныхМест.НомерПломбы, """") КАК НомерПломбы,
		|	ЕСТЬNULL(ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.КоличествоAu, 0) КАК Au,
		|	ЕСТЬNULL(ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.КоличествоAg, 0) КАК Ag,
		|	ЕСТЬNULL(ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.КоличествоSобщ, 0) КАК Sобщ,
		|	ЕСТЬNULL(ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.КоличествоCорг, 0) КАК Cорг,
		|	ЕСТЬNULL(ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.КоличествоAs, 0) КАК _As,
		|	ЕСТЬNULL(ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.КоличествоFe, 0) КАК Fe
		|ИЗ
		|	РегистрСведений.ДанныеЗатаркиТранспортировочныхМест КАК ДанныеЗатаркиТранспортировочныхМест
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСодержанияДМИПримесейВТранспортировочныхМестах КАК ДанныеСодержанияДМИПримесейВТранспортировочныхМестах
		|		ПО ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто = ДанныеСодержанияДМИПримесейВТранспортировочныхМестах.ТранспортировочноеМесто
		|ГДЕ
		|	ДанныеЗатаркиТранспортировочныхМест.ТранспортировочноеМесто = &ТранспортировочноеМесто";
	
	Запрос.УстановитьПараметр("ТранспортировочноеМесто", СтруктураДанных.ТранспортировочноеМесто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураДанных.ВесБруттоВлажный 	= ВыборкаДетальныеЗаписи.ВесБруттоВлажный;
		СтруктураДанных.ВесНеттоВлажный 	= ВыборкаДетальныеЗаписи.ВесНеттоВлажный;
		СтруктураДанных.ВесНеттоСухой	 	= Окр(ВыборкаДетальныеЗаписи.ВесНеттоСухой,0,РежимОкругления.Окр15как20);
		СтруктураДанных.НомерПломбы 		= ВыборкаДетальныеЗаписи.НомерПломбы;
		СтруктураДанных.Партия 				= ВыборкаДетальныеЗаписи.Партия;
		СтруктураДанных.Au					= ВыборкаДетальныеЗаписи.Au/1000;
		СтруктураДанных.Ag					= ВыборкаДетальныеЗаписи.Ag/1000;
		СтруктураДанных.Sобщ				= ВыборкаДетальныеЗаписи.Sобщ/1000;
		СтруктураДанных.Сорг				= ВыборкаДетальныеЗаписи.Cорг/1000;
		СтруктураДанных._As					= ВыборкаДетальныеЗаписи._As/1000;
		СтруктураДанных.Fe					= ВыборкаДетальныеЗаписи.Fe/1000;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиРасчетНаКлиенте()
	Если Объект.Продукция.Количество() <> 0 и Объект.Продукция.Итог("ВесНеттоВлажный") <> 0 Тогда 
		Объект.Влажность 		= Окр(((Объект.Продукция.Итог("ВесНеттоВлажный") - Объект.Продукция.Итог("ВесНеттоСухой"))/Объект.Продукция.Итог("ВесНеттоВлажный")) *100,5,РежимОкругления.Окр15как20);
		Объект.СодержаниеAu 		= Окр(Объект.Продукция.Итог("Au")*1000000/Объект.Продукция.Итог("ВесНеттоСухой") ,1,РежимОкругления.Окр15как20);
		Объект.СодержаниеAg 		= Окр(Объект.Продукция.Итог("Ag")*1000000/Объект.Продукция.Итог("ВесНеттоСухой") ,1,РежимОкругления.Окр15как20);
		
		Объект.ПримесиAs 		= Окр(100*Объект.Продукция.Итог("_As") / (Объект.Продукция.Итог("ВесНеттоСухой")*0.001) ,1,РежимОкругления.Окр15как20);
		Объект.ПримесиCорг 		= Окр(100*Объект.Продукция.Итог("Сорг") / (Объект.Продукция.Итог("ВесНеттоСухой")*0.001) ,2,РежимОкругления.Окр15как20);
		Объект.ПримесиFe 		= Окр(100*Объект.Продукция.Итог("Fe") / (Объект.Продукция.Итог("ВесНеттоСухой")*0.001) ,1,РежимОкругления.Окр15как20);
		Объект.ПримесиSобщ		= Окр(100*Объект.Продукция.Итог("Sобщ") / (Объект.Продукция.Итог("ВесНеттоСухой")*0.001) ,1,РежимОкругления.Окр15как20);
	Иначе
		Объект.Влажность 		= 0;
		Объект.СодержаниеAu 	= 0;
		Объект.СодержаниеAg 	= 0;
		
		Объект.ПримесиAs 		= 0;
		Объект.ПримесиCорг 		= 0;
		Объект.ПримесиFe 		= 0;
		Объект.ПримесиSобщ		= 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПриИзменении(Элемент)
	ПроизвестиРасчетНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияПослеУдаления(Элемент)
	ПроизвестиРасчетНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуНаСервере(СтруктураДанных)
	ВыбранноеЗначение = СтруктураДанных.ВыбранноеЗначение;
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("ТранспортировочноеМесто",ВыбранноеЗначение);
	НайденныеСтроки = ОБъект.Продукция.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.количество() = 0 Тогда 
		НоваяСтр = Объект.Продукция.Добавить();
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ТранспортировочноеМесто"	,ВыбранноеЗначение);
		СтруктураДанных.Вставить("Партия"					,ПредопределенноеЗначение("Справочник.ПартииПродукции.ПустаяСсылка"));
		СтруктураДанных.Вставить("ВесБруттоВлажный"			,0);
		СтруктураДанных.Вставить("ВесНеттоВлажный"			,0);
		СтруктураДанных.Вставить("ВесНеттоСухой"			,0);
		СтруктураДанных.Вставить("НомерПломбы"				,"");
		СтруктураДанных.Вставить("Au"						,0);
		СтруктураДанных.Вставить("Ag"						,0);
		СтруктураДанных.Вставить("Sобщ"						,0);
		СтруктураДанных.Вставить("Сорг"						,0);
		СтруктураДанных.Вставить("_As"						,0);
		СтруктураДанных.Вставить("Fe"						,0);
		ЗаполнитьСтруктуруДанныхВыпуска(СтруктураДанных);
		ЗаполнитьЗначенияСвойств(НоваяСтр,СтруктураДанных,,);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиИзТранспортиртировкиНаСервере(СтруктураДанных)
	Для каждого СтрокатТч из СтруктураДанных.ВыбранноеЗначение.Продукция Цикл 
		СтруктураДляПередачи = Новый Структура();
		СтруктураДляПередачи.Вставить("ВыбранноеЗначение",СтрокатТч.ТранспортировочноеМесто);
		ДобавитьСтрокуНаСервере(СтруктураДляПередачи);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьИзТранспортировки(Команда)
	параметрыФормы = Новый Структура;
	параметрыФормы.Вставить("Организация"		,Объект.Организация);
	параметрыФормы.Вставить("РежимВыбора"		,Истина);
	параметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца"		,Истина);
	параметрыФормы.Вставить("ЗакрыватьПриВыборе"		,Ложь);
	ФормаВыбора = ПолучитьФорму("Документ.ТранспортировкаПродукции.ФормаВыбора",параметрыФормы,ЭтаФорма,,,);	
	ФормаВыбора.Открыть();
КонецПроцедуры
